---
kind: property
id: P:Autodesk.Revit.DB.GeomCombination.AllMembers
source: html/e75ffab9-d5c4-d65f-2221-30bed43f0fe4.htm
---
# Autodesk.Revit.DB.GeomCombination.AllMembers Property

All elements that are joined in this geometry combination.

## Syntax (C#)
```csharp
public CombinableElementArray AllMembers { get; }
```

## Remarks
All members are generic forms, for more information, refer to GenericForm .

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when this geometry combination has already been deleted.